{"blog_content": "", "blog_img": [], "blog_credit": null, "download_timeout": 180.0, "depth": 0, "blog_url": "http://us-presidents.insidegov.com/stories/13835/us-president-quiz-obama-bush-reagan", "blog_athor": ["Posted on May 27, 2016 by ", "Taylor Johnson"], "blog_headline": "Data analysts at InsideGov set out to find your presidential equivalent. From George Washington to Barack Obama, we've got you covered.", "download_latency": 0.5490000247955322, "blog_title": ["\n\t\t\t\t\tWhich U.S. President Are You?\t\t\t\t"], "download_slot": "us-presidents.insidegov.com"}
{"blog_content": "Who’s the largest employer in the U.S.?When people hear that question, they tend to think of giant companies, like Wal-Mart, General Electric and McDonald’s. But the runaway leader isn’t a giant company. In fact, it’s not even a company.  With approximately 2.7 million civilian employees, the U.S. government is the largest employer in the country. For reference, Wal-Mart has 2.2 million employees worldwide. While this number reveals the enormity of the federal government, it doesn’t tell the full story of where these 2.7 million people work. After all, the U.S. government consists of dozens of departments and agencies, each with distinct goals and purposes.That’s why the team at InsideGov decided to take a deeper look at employment in the U.S. government. Using data from the Office of Personnel Management, we found the 25 government departments and agencies that had the most employees in September 2013. Non-civilians, like uniformed military personnel, are not included in these figures.It’s also important to note that these numbers only include federal personnel. The Bureau of Labor Statistics estimates that with state and local government positions, the total number of government employees in the U.S. jumps to over 21.8 million. ", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/The_Government_Agencies_that_Employ_the_Most_People_25458_13693.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tTim1965 / Wikimedia\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://federal-budget.insidegov.com/stories/13693/government-agencies-most-employees", "blog_athor": ["Posted on May 20, 2016 by ", "Alex Greer"], "blog_headline": "Using data from the Office of Personnel Management, InsideGov found the 25 government agencies that employ the most people. ", "download_latency": 0.6180000305175781, "blog_title": ["\n\t\t\t\t\tThe Government Agencies that Employ the Most People\t\t\t\t"], "download_slot": "federal-budget.insidegov.com"}
{"blog_content": "Bernie Sanders continues to be a fundraising force this presidential cycle, yet again bringing in more campaign cash than his Democratic rival, former Secretary of State Hillary Clinton. In April — despite a string of primary losses in delegate-rich states like New York and Pennsylvania — Sanders raised more than $26.9 million. In comparison, Clinton collected about $25 million, according to the latest data from the Federal Election Commission.As the InsideGov visualization shows, Sanders has raised more money than Clinton in each month of 2016. The Vermont senator has raised a total of $137,690,060 from January 1, 2016, to April 30, 2016, and more than $212.7 million overall.Sanders often points out that most of the money his campaign has raised comes from small-dollar donations — $27 a pop, according to the rallying cry. The Sanders campaign has deftly tapped into the anti-establishment flavor of the presidential race, engaging people frustrated with the large sums of money flooding into politics via super PACs. That, coupled with a robust online fundraising operation, created a perfect setup for so many of his supporters to contribute smaller sums.As the latest data shows, 61 percent of Sanders’ contributions come from donations of less than $200, the cutoff for what the FEC considers a large donation. The fundraising tallies are enviable data points for any politician, seeing as they indicate both breadth and depth of support. But all is not rosy on the Sanders’ campaign balance sheet. While Sanders has had unmatched fundraising success, his team has also spent heavily.In April, for example, the Sanders campaign spent about $38.6 million, almost $12 million more than it raised. The spending spree means the campaign has just shy of $5.8 million in reserves.This so-called cash on hand figure is an important, if often overlooked, data point in assessing a campaign’s overall health. Dwindling reserves mean there’s less money to work with to grow a staff, plan for a candidate’s travel and purchase ad time on television and radio. Although $5.8 million is a decent amount of money in political campaign terms, it isn’t that much when considering Sanders continues to fight tooth and nail against Clinton for the nomination. Should he beat the odds (and the math) to become the Democratic nominee, Sanders would pivot to a sprawling, nationwide general election without a ton of financial padding.The Sanders campaign’s bank account got its first big hit in January 2016, when it spent almost $35 million and saw its cash on hand dip to about $14.7 million. Significant spending in the next three months kicked the campaign’s burn rate — how much money is spent versus how much money is raised — to 97 percent. As the visualization shows, presumptive Republican nominee Donald Trump is also churning through his campaign stockpile, with a burn rate of 96 percent. But, as he often tells his supporters, Trump has largely self-funded his presidential run, loaning his campaign more than $43 million so far.Essentially, Trump is burning through his own cash.Indeed, of the remaining three candidates, Trump has the lowest amount of cash on hand at a little more than $2.4 million. Clinton has the most, with close to $30.2 million in the bank (or about $78.6 million, when accounting for pro-Clinton super PACs).Sanders’ supporters have been nothing if not enthusiastic, packing stadiums and parks for rallies and hitting the “contribute” button on the campaign’s website more than two million times. But a bruising and long Democratic primary fight means that, despite all of the excitement, Sanders (and Clinton, for that matter) would enter the general election a bit roughed up. Lower reserves don’t help that equation. Trump, on the other hand, sewed up the Republican nomination in early May and has spent the weeks since attempting to congeal party support around his candidacy. He also started a concerted effort with fundraising, naming a national finance chair on May 5 and attending a high-dollar fundraising event in Los Angeles last week.While Trump has plenty of general election vulnerabilities, he enters that race having not really tapped into the fundraising well yet. That gives him a fairly high ceiling for how much money he has the potential to raise in the upcoming months.The next primary is on June 7 in California, where Sanders is putting up a fight and showing some strong polling numbers. He has 1,497 pledged delegates to Clinton’s 1,768, although the spread balloons when accounting for superdelegates. Sanders has 1,539 total delegates to Clinton’s 2,305; 2,383 delegates are needed to secure the nomination.More: They Paid What for What? The Surprising, Odd Ways Political Campaigns Spend Their MoneyFollow InsideGov on Twitter: @inside_gov", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Bernie_Sanders_26679_14063.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tNoah Berger/AP Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://presidential-candidates.insidegov.com/stories/14063/sanders-campaign-fundraising-spending", "blog_athor": ["Posted on June 1, 2016 by ", "Palmer Gibbs"], "blog_headline": "Using campaign finance data from the FEC, InsideGov analyzes Sen. Bernie Sanders' fundraising (and spending) during the presidential race so far.", "download_latency": 0.6180000305175781, "blog_title": ["\n\t\t\t\t\tBernie’s Bucks: Sanders’ Fundraising — and Spending — Prowess in 5 Charts\t\t\t\t"], "download_slot": "presidential-candidates.insidegov.com"}
{"blog_content": "With an approval rating of 17 percent, the 114th Congress is one of the most unpopular in U.S. history. From threats of a government shutdown to extensive gridlock, Congress has been widely criticized on both sides of the aisle.  There are, however, some members who stand out from the pack for their leadership in the House and Senate. InsideGov decided to take a closer look at the top leaders in Congress from the 2015 legislative year. Using data from GovTrack, InsideGov ranked the current members of Congress in terms of their committee leadership positions (i.e. chairperson or ranking member). GovTrack assigns five points for each full committee leadership position and one point for each subcommittee leadership position. As a result, House Speaker Paul Ryan, R-Wis., and Senate Majority Leader Mitch McConnell, R-Ky., did not make this list even though they have key leadership roles.Committees serve many important roles in Congress and are an essential part of the lawmaking process. Each political party assigns committee seats and chooses who serves in the leadership positions. Committees are generally led by a chairperson (who is selected by the majority party) and a ranking member (who is selected by the minority party).Note that these rankings reflect only the committee positions of members of Congress, not the number of bills they may have passed. In the event of a tie, senators are ranked higher than representatives. When ties cannot be broken by office type, members of Congress are ordered by the number of years they have served in their current role and lastly by alphabetical order.", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Barbara_Boxer_24281_13207.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tLauren Victoria Burke / AP Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://members-of-congress.insidegov.com/stories/13207/most-influential-congressional-leaders", "blog_athor": ["Posted on May 7, 2016 by ", "Alex Greer"], "blog_headline": "Using data from GovTrack, InsideGov found the most influential leaders in Congress.", "download_latency": 0.7409999370574951, "blog_title": ["\n\t\t\t\t\tThe Most Influential Congressional Leaders\t\t\t\t"], "download_slot": "members-of-congress.insidegov.com"}
{"blog_content": "The role of women in politics and leadership has proven to be a particularly flammable storyline throughout the 2016 election, whether it’s Donald Trump’s feud with Fox journalist Megyn Kelly or his assertion that Hillary Clinton is “playing the woman card left and right” in the presidential contest. (For her part, the former secretary of state cashed in on Trump’s comment, collecting $2.4 million in a fundraising campaign based off the remark.)During an MSNBC town hall in April, Clinton said if she were elected president, she would have a Cabinet that was 50 percent female. And the week before, the Democrat’s campaign told the Boston Globe that women will be on the list of Clinton’s potential vice presidential picks. For a brief time, former presidential hopeful Carly Fiorina actually was a VP candidate, when she joined Texas Sen. Ted Cruz’s Republican presidential ticket in late April.With gender-focused narratives dominating national headlines, Graphiq politics site InsideGov decided to investigate female representation in politics on a state level. Using data from the National Conference of State Legislatures, InsideGov ranked the 25 states with the highest percentage of women in elected office. The data, as of March 2016, counts how many women hold elected office in each state’s House and Senate and finds a percentage based on the total number of seats in both chambers. When necessary, InsideGov broke ranking ties by the total number of women legislators, and then alphabetically.The U.S. Census Bureau finds that women make up 50.8 percent of the U.S. population. But the state government data shows that, overall, just 24.5 percent of state legislators are women. All of the states on this list have legislatures composed of at least 25 percent women, but even the top state doesn’t meet the 50 percent mark.", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/M_Teresa_Paiva-Weed_24625_13497.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tSteven Senne/AP Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://governors.insidegov.com/stories/13497/states-elected-women-politics-legislature", "blog_athor": ["Posted on May 10, 2016 by ", "Palmer Gibbs"], "blog_headline": "With gender-focused narratives dominating national headlines, InsideGov decided to investigate female representation in politics on a state level. Using data from the National Conference of State Legislatures, InsideGov ranked the 25 states with the highest percentage of women in elected office.", "download_latency": 1.7559998035430908, "blog_title": ["\n\t\t\t\t\tStates with the Most Women in Politics\t\t\t\t"], "download_slot": "governors.insidegov.com"}
{"blog_content": "Money and politics are a bit like milk and cookies: You can’t really have one without the other. While that’s always been true, the dynamic shifted dramatically in 2010 when super PACs entered the fray, courtesy the Supreme Court case Citizens United v. FEC. The new setup has some political prognosticators anticipating a presidential election that costs upward of $5 billion.Although Election Day is still months away, super PACs already have raised piles and piles of cash for their preferred candidates and causes. Of the 2016 White House hopefuls still in the race, Hillary Clinton has received the most super PAC support. The three super PACs backing the former secretary of state have raised a combined $94,588,442, according to the most recent campaign finance filings with the Federal Election Commission. An InsideGov analysis of the data reveals that seven-figure contributions from just 24 people dominate pro-Clinton super PAC fundraising. Those donors have given a combined $65,642,904 to the three super PACs — accounting for about 69 percent of the combined total the groups have raised.InsideGov examines the people who have given at least $1 million to pro-Clinton super PACs, ranking the list from smallest to largest contribution. In the event of a tie, people are listed alphabetically. The data reflects the most recent filings, which include fundraising figures through April 30, 2016.* Note: Unlike candidate committees, super PACs can collect and spend unlimited sums of money. They cannot collaborate with the official campaign, and therefore cannot pay for things like campaign staffers’ salaries or a candidate’s travel. But super PACs can cut ads and distribute materials that support a specific candidate.The three super PACs supporting Clinton’s presidential campaign are Priorities USA Action, American Bridge 21st Century and Correct the Record. Read InsideGov’s previous analysis of the groups and their fundraising here. ", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Hillary_Clinton_26346_13955.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tJustin Sullivan/Getty Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://presidential-candidates.insidegov.com/stories/13955/clinton-super-pacs-million-dollar-donors", "blog_athor": ["Posted on May 26, 2016 by ", "Palmer Gibbs"], "blog_headline": "An InsideGov analysis of campaign finance data reveals that seven-figure contributions from just 24 people dominate pro-Hillary Clinton super PAC fundraising.", "download_latency": 0.5420000553131104, "blog_title": ["\n\t\t\t\t\t24 People, $65.6 Million: Who Is Doling Out the Dough for Pro-Clinton Super PACs?\t\t\t\t"], "download_slot": "presidential-candidates.insidegov.com"}
{"blog_content": "One of the most debated issues in the 2016 presidential election revolves around the growing budget deficit. The Congressional Budget Office reports the total federal deficit for 2016 will be $534 billion, an increase of nearly $100 billion from the previous year. That number is expected to double by 2023. How to balance the budget remains a tricky question, and one that highlights the ideological differences between most Democrats and Republicans. Should taxes be raised? Government spending cut? Regardless of the approach, it’s important to first know how the U.S. spends its money. That’s why the team at Graphiq politics site InsideGov decided to take a closer look at the federal budget. Using data from the Office of Management and Budget, we ranked the federal government agencies that were allocated the most money in the 2016 fiscal year. The 2016 figures are estimates, according to the office's data.The Office of Management and Budget provides government outlay data from 1962 to 2021. If an agency was established after 1962, the office lists spending attributable to predecessor agencies. Note that all figures are inflation adjusted to the 2009 value of the dollar, the year the Office of Management and Budget uses as its framework.Remarkably, approximately half of all government outlays go to just two agencies: the Social Security Administration and the Department of Health and Human Services. ", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Pentagon_24928_13371.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tDavid B. Gleason / Wikipedia\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://federal-budget.insidegov.com/stories/13371/government-agencies-most-money", "blog_athor": ["Posted on May 12, 2016 by ", "Alex Greer"], "blog_headline": "InsideGov found the 25 government agencies that receive the most money.", "download_latency": 0.5710000991821289, "blog_title": ["\n\t\t\t\t\tThese Government Agencies Receive the Most Money\t\t\t\t"], "download_slot": "federal-budget.insidegov.com"}
{"blog_content": "Political campaigns are hectic, expensive undertakings. Candidates and their staffers travel all over the country by planes, trains and automobiles. They eat at roadside diners and in the drive-thru lane, and fuel up for campaign rallies and fundraisers at Dunkin’ Donuts and Starbucks. Indeed, an InsideGov analysis of campaign finance data found presidential campaigns have spent $2,661 at Starbucks in this cycle.InsideGov, a politics site that’s part of the Graphiq suite of research tools, decided to look more closely at how 2016 White House hopefuls spent their campaign cash. Using expenditure data from the Federal Election Commission and the Sunlight Foundation, InsideGov picked out some of the quirkiest purchases made by the presidential campaigns. The data covers Jan. 1, 2015 to Feb. 29, 2016, and the list is ranked from smallest to largest amount spent.", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Donald_Trump_25707_13870.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tElaine Thompson/AP Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://presidential-candidates.insidegov.com/stories/13870/political-campaign-expenditures-money-surprising", "blog_athor": ["Posted on May 25, 2016 by ", "Palmer Gibbs"], "blog_headline": "InsideGov decided to look closely at how 2016 White House hopefuls spent their campaign cash.", "download_latency": 0.5369999408721924, "blog_title": ["\n\t\t\t\t\tThey Paid What for What? The Surprising, Odd Ways Political Campaigns Spend Their Money\t\t\t\t"], "download_slot": "presidential-candidates.insidegov.com"}
{"blog_content": "Donald Trump clawed to his first lead in a general election matchup against Hillary Clinton, surpassing the former secretary of state by 0.2 percent as of May 21. Clinton’s double-digit lead evaporated in the last six weeks as Trump mounted a slow and steady climb throughout April, according to polling averages from RealClearPolitics. As the InsideGov visualization shows, Clinton and Trump have maintained a close competition in a head-to-head race. Although Clinton has bested Trump consistently, the race did tighten to under 1 percent twice so far: On Sept. 12, Clinton led by 0.8 percent, and on Dec. 1, she led by just 0.6 percent. But Trump’s first lead — no matter how razor-thin — comes at a critical moment in the race, as both parties sew up their nomination fights and attention shifts to the general election. Trump vanquished his fellow Republicans in early May, when Texas Sen. Ted Cruz and Ohio Gov. John Kasich dropped out of the race. Although polling dips and upticks happen for any number of reasons, Trump has started to focus his jabs at the Clinton campaign in the weeks since he secured his party’s nomination. Trump has revived ’90s era scandals and questions about former President Bill Clinton’s sexual conduct. Trump sought to connect Hillary Clinton to her husband’s behavior, telling a crowd in Oregon, “She was an unbelievably nasty, mean enabler and what she did to a lot of those women is disgraceful.”Clearly, Trump will continue to rely on the guns-blazing playbook he used expertly — and effectively — in the Republican primary.For the Democrats, Vermont Sen. Bernie Sanders remains in the race despite a virtually insurmountable deficit in delegates. Last week, in a nod to the data visualized below, Clinton told CNN she “will be the nominee” and that it “is already done, in effect.”But Clinton is also making overtures to the more progressive wing of the party, many of whom remain firmly in Sanders’ corner despite the lopsided delegate math. During a “Meet the Press” spot on Sunday, Clinton repeatedly used the expression “stronger together,” a slogan-ready phrase she used as a welcome mat to both Sanders supporters — and political independents.“We are stronger together, in facing our internal challenges and our external ones,” Clinton said during the interview. “We are stronger together when we have a bipartisan, even nonpartisan foreign policy that protects our country. … When I look at where we are in our country together, we need to unify the country. We are stronger together, when we act on a set of plans and priorities that will redound to the benefit of the American people.”Clinton seems to have an uphill battle ahead of her. The most recent ABC News/Washington Post poll shows Clinton is viewed unfavorably by 53 percent of Americans. Indeed, Trump has been able to corral many Republican voters simply because he’s the sole option to defeat Clinton in the general election.However, Trump doesn’t fare much better in the same poll, which finds he is viewed unfavorably by 60 percent of Americans. Those figures make “this a matchup between the two most unpopular likely presidential candidates in the history of ABC/Post election polls, dating back to 1984,” according to the report on the data.Bottom line: Look for the slugfest to continue. Those historic unfavorable numbers, combined with years spent in the public eye, provide plenty of fodder for a negative campaign between Clinton and Trump. In 2016, the race for the highest office in the land might end up being a race to the bottom. More: Polls Find Sanders, Not Clinton, Has Better Chance Against Trump  Follow InsideGov on Twitter: @inside_gov", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Donald_Trump_25850_13910.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tMark Humphrey/AP Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://presidential-candidates.insidegov.com/stories/13910/trump-clinton-poll-first-lead", "blog_athor": ["Posted on May 24, 2016 by ", "Palmer Gibbs"], "blog_headline": "Donald Trump just clawed to his first lead in a general election matchup against Hillary Clinton, surpassing the former secretary of state by 0.2 percent as of May 21.", "download_latency": 0.6529998779296875, "blog_title": ["\n\t\t\t\t\tTrump Nabs First Lead Against Clinton in Poll\t\t\t\t"], "download_slot": "presidential-candidates.insidegov.com"}
{"blog_content": "In a general election matchup, Vermont Sen. Bernie Sanders topples Donald Trump by twice as much as Hillary Clinton, according to polling data from RealClearPolitics. While this doesn’t seal the deal for a Sanders victory — a lot can and will happen in the six months between now and November — it certainly buoys Sanders’ assertion that he should remain in the race.On the Republican side, the field narrowed for a decisive, final time last week as Texas Sen. Ted Cruz and Ohio Gov. John Kasich dropped out after Trump won the Indiana primary. Trump remains shy of the necessary 1,237 delegates needed for the nomination, but the lack of active competitors means the businessman-turned-reality-TV-star is the presumptive Republican nominee.With a tumultuous GOP primary in the rearview mirror, Graphiq politics site InsideGov turns to general election matchups to see how Trump fares against each of his potential Democratic foes.Trump vs. ClintonIn a December 2015 “Saturday Night Live” skit that saw the return of Amy Poehler and Tina Fey, the comedy writers called a runaway win for Clinton against Trump. But a look at polling data paints a different picture.As of May 9, Clinton holds about a six-point lead over Trump in a general election contest. As the visualization shows, the former secretary of state has maintained an advantage over Trump throughout the campaign, with the gap beginning to widen in mid-March.On March 15, both Clinton and Trump scored big wins on Super Tuesday II, which might explain the shift. Although there have been many ups and downs in the race, that was a critical moment because it was one of the first times either Clinton or Trump truly proved their frontrunner status. Clinton swept the board, while Trump lost only one primary. In the process, Trump knocked out Florida Sen. Marco Rubio, who suffered a deflating loss in his home state and had been seen as one of the GOP’s best options to fend off Trump.In some ways, that was the first instance a Clinton-Trump race looked like a real possibility. And since then, Clinton has maintained her lead, according to the polling data.But the news isn’t all good for Clinton’s camp. A recent poll from Quinnipiac University shows tight races brewing between Clinton and Trump in the key battleground states of Florida, Pennsylvania and Ohio.As the visualization shows, Clinton clings to a one-point lead in Florida and Pennsylvania. She is down by four in Ohio. The margin of error in all three surveys is plus or minus 3 percentage points, meaning that these razor-thin differences are around this range.Bottom line: These states are in tossup territory right now.Trump vs. SandersDespite being far behind Clinton in the delegate race, Sanders continues to pledge to stay in the Democratic nomination contest until the final primary in June. While that has frustrated the Clinton campaign, general election polling indicates Sanders has a better shot than Clinton at beating Trump come November.While Clinton currently has a 6.4-point lead over Trump, Sanders doubles that, according to polling data. As of May 9, Sanders is up by 13 points against Trump. As was the case with Clinton, Sanders’ lead widened in mid-March, when Trump’s string of decisive primary wins suggested he was on his way to nabbing the Republican nomination. Since those victories, Trump has hovered at or below 40 percent against both Clinton and Sanders.Sanders often reminds his supporters that polling data points to him beating Trump by a larger margin than Clinton. And, in the recent Quinnipiac poll on swing states, Sanders beats Trump by two points in Florida and Ohio, and by six points in Pennsylvania.That same Quinnipiac poll also asked voters in each state about how they view the three remaining presidential candidates. In more good news for the Sanders camp, the Vermont senator was the only person who is viewed more favorably than unfavorably in all three battleground states. In Pennsylvania, Sanders has his highest score — a 50 percent favorability rating. In Florida and Ohio, 43 percent and 45 percent have a positive view of him, respectively.Clinton and Trump, on the other hand, are viewed unfavorably by the majority of voters in the three states polled. Clinton’s unfavorable score hits a high of 62 percent in Ohio, while Trump’s top out at 57 percent in Florida and Ohio. In addition, voters seem to have made up their minds about those two candidates. In Ohio, for example, only 2 percent of voters said they haven’t heard enough about Clinton to decide if they viewed her positively or negatively. Trump’s numbers for that question were also in the low single digits.There’s more wiggle room for Sanders, though. Between 12 and 14 percent of voters in those states said they hadn’t heard enough about Sanders to make an assessment.These are good numbers for Sanders, but one figure continues to trip up his campaign: 2,383. That’s the number of delegates needed to secure the Democratic nomination. Even after wins in Indiana and West Virginia, Sanders remains far behind Clinton in the delegate count.Delegate math continues to be a significant hurdle for Sanders. There are a total of 1,065 more Democratic delegates up for grabs in the primary process. He would need to win all but 115 to capture the nomination. The Kentucky and Oregon primaries take place on Tuesday.More: Bernie Sanders Still the 2016 Fundraising Champ Follow InsideGov on Twitter: @inside_gov ", "blog_img": ["https://s.graphiq.com/sites/default/files/stories/t4/Bernie_Sanders_25290_13619.jpg"], "blog_credit": "\n\t\t\t\t\tCredit: \t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tJustin Sullivan/Getty Images\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t", "download_timeout": 180.0, "depth": 0, "blog_url": "http://presidential-candidates.insidegov.com/stories/13619/sanders-not-clinton-beats-trump-polls", "blog_athor": ["Posted on May 12, 2016 by ", "Palmer Gibbs"], "blog_headline": "With a tumultuous GOP primary in the rearview mirror, Graphiq politics site InsideGov turns to general election match-ups to see how Donald Trump fares against Hillary Clinton and Bernie Sanders.\n", "download_latency": 0.7929999828338623, "blog_title": ["\n\t\t\t\t\tPolls Find Sanders, Not Clinton, Has Better Chance Against Trump\t\t\t\t"], "download_slot": "presidential-candidates.insidegov.com"}
