{"website": "http://www.ibm.com", "company_style": "上市公司", "company_img": "https://media.licdn.com/media/AAEAAQAAAAAAAAWOAAAAJGQyNGEzNmFiLTYwYjMtNDc3Zi1hZWM4LWI2NzFhNWY2MWY5MQ.png", "company_url": "https://www.linkedin.com/company/ibm?trk=top_nav_home", "company_logo": "https://media.licdn.com/mpr/mpr/shrink_200_200/AAEAAQAAAAAAAAalAAAAJGVhNjkzZjNkLWNmZjUtNDUxMS1hODJkLTMzNjllOTM0N2RmNQ.png", "start_year": null, "company_field": "信息技术和服务", "company_name": "IBM", "specialties": "IT Services, Consulting, Business Analytics & Optimization, CRM, ERP, security, software, strategy, storage, disaster recovery, enterprise architecture, BPM, Smarter Planet, Outsourcing, semiconductors, microprocessors", "location": "美国 NY Armonk, New York, International Business Machines Corp. New Orchard Road 10504", "introducation": "IBM is a global technology and innovation company headquartered in Armonk, NY. It is the largest technology and consulting employer in the world, with more than 400,000 employees serving clients in 170 countries. IBM offers a wide range of technology and consulting services; a broad portfolio of middleware for collaboration, predictive analytics, software development and systems management; and the world's most advanced servers and supercomputers. Utilizing its business consulting, technology and R&D expertise, IBM helps clients become \"smarter\" as the planet becomes more digitally interconnected. IBM invests more than $6 billion a year in R&D, and just completed its 22nd year of patent leadership. IBM Research has received recognition beyond any commercial technology research organization and is home to 5 Nobel Laureates, 9 US National Medals of Technology, 5 US National Medals of Science, 6 Turing Awards, and 10 Inductees in US Inventors Hall of Fame. The company was behind the inventions of the PC; SABRE travel reservation system; UPC codes, Watson, the Jeopardy!-playing computing system, and much more.\n\nOfficial IBM LinkedIn account. Managed by Katie Keating and George Faulkner. Follows IBM Social Computing Guidelines. We reserve the right to delete comments that are offensive or suggestive, personal attacks, anonymous, wildly off-topic, spam or advertisements.", "company_scale": "超过 10,001 名员工"}
